//1.Вивести числа від 20 до 30 через пропуск, використовуючи крок 0,5 (20 20,5 21 21,5….).
for( num = 20; num<=30; num += 0.5 ){
    console.log(num);
}


//2.Один долар коштує 27 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів.
for (let num=10; num<=100;  num+=10) {
    console.log(num*27)

}


//3.Дане ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N.

const n = 2500;
for(num=1; num<=100; num++){
    Math.pow(num,2);
    if (num**2<=2500)
    console.log (num**2)
}



//4.Дане ціле число. З'ясувати, чи є воно простим (простим називається число, більше 1, які не мають інших дільників крім 1 і себе).
let a = 81;
for (let i = 2; i <= a; i++) { 
    if(a%i===0 && i<a) {
        console.log(`Число  ${a} не є простим`);
        console.log(`Число ${a} ділиться на ${i}`)
        break;
    }
    else if(a%i===0 && i===a){
    console.log(`Число  ${a} є простим `);
    }
  }

//5.Дане деяке число. Визначити, чи можна одержати це число шляхом зведення числа 3 у деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна).

    let b = 19683;
    for(i=3; i<=b; i++){
        if(3**i>b){
        console.log(`Число ${b}   не можемо отримати зведення числа 3 у деякий ступінь.`);
        break;
        }
        else if(3**i===b){
            console.log(`Число ${b} можна отримати зведенням числа 3 в ступінь ${i}`);
            break;
        }
        
    }